In [146]:
import numpy as np
import pandas as pd

# On a custom dataset first

## Creating a pandas dataframe for a small dataset

In [147]:
data = {
    'EmployeeID': [1, 2, 3, 4, 5],
    'YearsExperience': [2, 4, np.nan, 3, 5],
    'Salary': [50000, 60000, 45000, np.nan, 70000],
    'PerformanceRating': ['Excellent', 'Good', 'Poor', 'Good', 'Excellent']
}

df = pd.DataFrame(data)
print(df)

   EmployeeID  YearsExperience   Salary PerformanceRating
0           1              2.0  50000.0         Excellent
1           2              4.0  60000.0              Good
2           3              NaN  45000.0              Poor
3           4              3.0      NaN              Good
4           5              5.0  70000.0         Excellent

## Data Cleaning

In [148]:
df.dropna(inplace=True)
print(df)

   EmployeeID  YearsExperience   Salary PerformanceRating
0           1              2.0  50000.0         Excellent
1           2              4.0  60000.0              Good
4           5              5.0  70000.0         Excellent

## Transforming the data

In [149]:
df['YearsExperience'] = df['YearsExperience'] ** 2
print(df)

   EmployeeID  YearsExperience   Salary PerformanceRating
0           1              4.0  50000.0         Excellent
1           2             16.0  60000.0              Good
4           5             25.0  70000.0         Excellent

## Reducing the data

In [150]:
df.drop('EmployeeID', axis=1, inplace=True)
print(df)

   YearsExperience   Salary PerformanceRating
0              4.0  50000.0         Excellent
1             16.0  60000.0              Good
4             25.0  70000.0         Excellent

## Assessing data quality

In [151]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 0 to 4
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   YearsExperience    3 non-null      float64
 1   Salary             3 non-null      float64
 2   PerformanceRating  3 non-null      object
dtypes: float64(2), object(1)
memory usage: 96.0+ bytes
None

## Encoding categorical data

In [152]:
df['PerformanceRating'] = df['PerformanceRating'].map({'Poor': 0, 'Good': 1, 'Excellent': 2})
print(df)

   YearsExperience   Salary  PerformanceRating
0              4.0  50000.0                  2
1             16.0  60000.0                  1
4             25.0  70000.0                  2

## Splitting the dataset

In [153]:
from sklearn.model_selection import train_test_split

X = df[['YearsExperience', 'Salary']]
y = df['PerformanceRating']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=1)
print(X_train)
print()
print(X_test)

   YearsExperience   Salary
4             25.0  70000.0
1             16.0  60000.0

   YearsExperience   Salary
0              4.0  50000.0

## Scaling the features

In [154]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
X_train_scaled = scaler.fit_transform(X_train)
X_test_scaled = scaler.transform(X_test)

print(X_train_scaled)
print(X_test_scaled)

[[ 1.  1.]
 [-1. -1.]]
[[-3.66666667 -3.        ]]

# Applying on titanic dataset

## Step 1: Acquiring the dataset

In [155]:
titanic_df = pd.read_csv('https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv')
print(titanic_df.head(10))
print("------------------------------------------------------------------------------")
print(titanic_df.dtypes)
print("------------------------------------------------------------------------------")
print(titanic_df.describe(include="all"))

   Survived  Pclass                                               Name  \
0         0       3                             Mr. Owen Harris Braund
1         1       1  Mrs. John Bradley (Florence Briggs Thayer) Cum...
2         1       3                              Miss. Laina Heikkinen
3         1       1        Mrs. Jacques Heath (Lily May Peel) Futrelle
4         0       3                            Mr. William Henry Allen
5         0       3                                    Mr. James Moran
6         0       1                             Mr. Timothy J McCarthy
7         0       3                      Master. Gosta Leonard Palsson
8         1       3   Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson
9         1       2                 Mrs. Nicholas (Adele Achem) Nasser

      Sex   Age  Siblings/Spouses Aboard  Parents/Children Aboard     Fare
0    male  22.0                        1                        0   7.2500
1  female  38.0                        1                        0  71.2833
2  female  26.0                        0                        0   7.9250
3  female  35.0                        1                        0  53.1000
4    male  35.0                        0                        0   8.0500
5    male  27.0                        0                        0   8.4583
6    male  54.0                        0                        0  51.8625
7    male   2.0                        3                        1  21.0750
8  female  27.0                        0                        2  11.1333
9  female  14.0                        1                        0  30.0708
------------------------------------------------------------------------------
Survived                     int64
Pclass                       int64
Name                        object
Sex                         object
Age                        float64
Siblings/Spouses Aboard      int64
Parents/Children Aboard      int64
Fare                       float64
dtype: object
------------------------------------------------------------------------------
          Survived      Pclass                    Name   Sex         Age  \
count   887.000000  887.000000                     887   887  887.000000
unique         NaN         NaN                     887     2         NaN
top            NaN         NaN  Mr. Owen Harris Braund  male         NaN
freq           NaN         NaN                       1   573         NaN
mean      0.385569    2.305524                     NaN   NaN   29.471443
std       0.487004    0.836662                     NaN   NaN   14.121908
min       0.000000    1.000000                     NaN   NaN    0.420000
25%       0.000000    2.000000                     NaN   NaN   20.250000
50%       0.000000    3.000000                     NaN   NaN   28.000000
75%       1.000000    3.000000                     NaN   NaN   38.000000
max       1.000000    3.000000                     NaN   NaN   80.000000

        Siblings/Spouses Aboard  Parents/Children Aboard       Fare
count                887.000000               887.000000  887.00000
unique                      NaN                      NaN        NaN
top                         NaN                      NaN        NaN
freq                        NaN                      NaN        NaN
mean                   0.525366                 0.383315   32.30542
std                    1.104669                 0.807466   49.78204
min                    0.000000                 0.000000    0.00000
25%                    0.000000                 0.000000    7.92500
50%                    0.000000                 0.000000   14.45420
75%                    1.000000                 0.000000   31.13750
max                    8.000000                 6.000000  512.32920

## Step 2: Cleaning the data

### Generating and handling missing values

In [156]:
import pandas as pd
import numpy as np

np.random.seed(42)

data = {
    'Survived': np.random.choice([0, 1], size=200),
    'Pclass': np.random.choice([1, 2, 3], size=200),
    'Name': [f'Person_{i}' for i in range(1, 201)],
    'Sex': np.random.choice(['male', 'female'], size=200),
    'Age': np.random.choice([np.nan, *np.arange(10, 71)], size=200),
    'Siblings/Spouses Aboard': np.random.randint(0, 4, size=200),
    'Parents/Children Aboard': np.random.randint(0, 3, size=200),
    'Fare': np.random.choice([np.nan, *np.arange(10, 101, 10)], size=200)
}

df = pd.DataFrame(data)

for column in ['Age', 'Fare']:
    df.loc[df.sample(frac=0.2).index, column] = np.nan

print(df)

print("---------------------------------------")

from sklearn.impute import SimpleImputer

columns_with_missing = ['Age', 'Fare']

imputer = SimpleImputer(strategy='mean')  # You can choose 'median', 'most_frequent', or a constant value

df[columns_with_missing] = imputer.fit_transform(df[columns_with_missing])


titanic_df = pd.concat([titanic_df, df], ignore_index=True)
# titanic_df.drop('FamilySize',axis=1,inplace=True)
print(titanic_df.tail(10))

     Survived  Pclass        Name     Sex   Age  Siblings/Spouses Aboard  \
0           0       3    Person_1    male  13.0                        1
1           1       3    Person_2  female  44.0                        3
2           0       1    Person_3    male  42.0                        2
3           0       1    Person_4    male   NaN                        2
4           0       2    Person_5    male  39.0                        0
..        ...     ...         ...     ...   ...                      ...
195         1       2  Person_196    male  15.0                        2
196         1       3  Person_197    male  33.0                        3
197         1       1  Person_198  female  53.0                        2
198         0       1  Person_199  female  12.0                        1
199         0       1  Person_200  female  44.0                        1

     Parents/Children Aboard  Fare
0                          1  20.0
1                          1   NaN
2                          1  40.0
3                          2  30.0
4                          2  70.0
..                       ...   ...
195                        2   NaN
196                        2  30.0
197                        0  50.0
198                        2  60.0
199                        2  80.0

[200 rows x 8 columns]
---------------------------------------
      Survived  Pclass        Name     Sex        Age  \
1077         0       1  Person_191    male  53.000000
1078         0       2  Person_192  female  39.742138
1079         0       1  Person_193    male  30.000000
1080         0       2  Person_194  female  39.742138
1081         0       1  Person_195  female  25.000000
1082         1       2  Person_196    male  15.000000
1083         1       3  Person_197    male  33.000000
1084         1       1  Person_198  female  53.000000
1085         0       1  Person_199  female  12.000000
1086         0       1  Person_200  female  44.000000

      Siblings/Spouses Aboard  Parents/Children Aboard        Fare
1077                        0                        1  100.000000
1078                        3                        2   60.000000
1079                        3                        1   54.551724
1080                        1                        1   40.000000
1081                        3                        1   40.000000
1082                        2                        2   54.551724
1083                        3                        2   30.000000
1084                        2                        0   50.000000
1085                        1                        2   60.000000
1086                        1                        2   80.000000

In [157]:
titanic_df.dropna(subset=['Age'], inplace=True)
print(titanic_df)

      Survived  Pclass                                               Name  \
0            0       3                             Mr. Owen Harris Braund
1            1       1  Mrs. John Bradley (Florence Briggs Thayer) Cum...
2            1       3                              Miss. Laina Heikkinen
3            1       1        Mrs. Jacques Heath (Lily May Peel) Futrelle
4            0       3                            Mr. William Henry Allen
...        ...     ...                                                ...
1082         1       2                                         Person_196
1083         1       3                                         Person_197
1084         1       1                                         Person_198
1085         0       1                                         Person_199
1086         0       1                                         Person_200

         Sex   Age  Siblings/Spouses Aboard  Parents/Children Aboard  \
0       male  22.0                        1                        0
1     female  38.0                        1                        0
2     female  26.0                        0                        0
3     female  35.0                        1                        0
4       male  35.0                        0                        0
...      ...   ...                      ...                      ...
1082    male  15.0                        2                        2
1083    male  33.0                        3                        2
1084  female  53.0                        2                        0
1085  female  12.0                        1                        2
1086  female  44.0                        1                        2

           Fare
0      7.250000
1     71.283300
2      7.925000
3     53.100000
4      8.050000
...         ...
1082  54.551724
1083  30.000000
1084  50.000000
1085  60.000000
1086  80.000000

[1087 rows x 8 columns]

## Step 3: Transforming the data

In [158]:
titanic_df['FamilySize'] = titanic_df['Siblings/Spouses Aboard'] + titanic_df['Parents/Children Aboard']
print(titanic_df)

      Survived  Pclass                                               Name  \
0            0       3                             Mr. Owen Harris Braund
1            1       1  Mrs. John Bradley (Florence Briggs Thayer) Cum...
2            1       3                              Miss. Laina Heikkinen
3            1       1        Mrs. Jacques Heath (Lily May Peel) Futrelle
4            0       3                            Mr. William Henry Allen
...        ...     ...                                                ...
1082         1       2                                         Person_196
1083         1       3                                         Person_197
1084         1       1                                         Person_198
1085         0       1                                         Person_199
1086         0       1                                         Person_200

         Sex   Age  Siblings/Spouses Aboard  Parents/Children Aboard  \
0       male  22.0                        1                        0
1     female  38.0                        1                        0
2     female  26.0                        0                        0
3     female  35.0                        1                        0
4       male  35.0                        0                        0
...      ...   ...                      ...                      ...
1082    male  15.0                        2                        2
1083    male  33.0                        3                        2
1084  female  53.0                        2                        0
1085  female  12.0                        1                        2
1086  female  44.0                        1                        2

           Fare  FamilySize
0      7.250000           1
1     71.283300           1
2      7.925000           0
3     53.100000           1
4      8.050000           0
...         ...         ...
1082  54.551724           4
1083  30.000000           5
1084  50.000000           2
1085  60.000000           3
1086  80.000000           3

[1087 rows x 9 columns]

## Step 4: Reducing the data

In [159]:
titanic_df.drop(['Name'], axis=1, inplace=True)
print(titanic_df)

      Survived  Pclass     Sex   Age  Siblings/Spouses Aboard  \
0            0       3    male  22.0                        1
1            1       1  female  38.0                        1
2            1       3  female  26.0                        0
3            1       1  female  35.0                        1
4            0       3    male  35.0                        0
...        ...     ...     ...   ...                      ...
1082         1       2    male  15.0                        2
1083         1       3    male  33.0                        3
1084         1       1  female  53.0                        2
1085         0       1  female  12.0                        1
1086         0       1  female  44.0                        1

      Parents/Children Aboard       Fare  FamilySize
0                           0   7.250000           1
1                           0  71.283300           1
2                           0   7.925000           0
3                           0  53.100000           1
4                           0   8.050000           0
...                       ...        ...         ...
1082                        2  54.551724           4
1083                        2  30.000000           5
1084                        0  50.000000           2
1085                        2  60.000000           3
1086                        2  80.000000           3

[1087 rows x 8 columns]

## Step 5: Assessing data quality

In [160]:
print(titanic_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1087 entries, 0 to 1086
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 1087 non-null   int64
 1   Pclass                   1087 non-null   int64
 2   Sex                      1087 non-null   object
 3   Age                      1087 non-null   float64
 4   Siblings/Spouses Aboard  1087 non-null   int64
 5   Parents/Children Aboard  1087 non-null   int64
 6   Fare                     1087 non-null   float64
 7   FamilySize               1087 non-null   int64
dtypes: float64(2), int64(5), object(1)
memory usage: 68.1+ KB
None

## Step 6: Encoding categorical data

In [161]:
titanic_df['Sex'] = titanic_df['Sex'].map({'male': 0, 'female': 1})
print(titanic_df)

      Survived  Pclass  Sex   Age  Siblings/Spouses Aboard  \
0            0       3    0  22.0                        1
1            1       1    1  38.0                        1
2            1       3    1  26.0                        0
3            1       1    1  35.0                        1
4            0       3    0  35.0                        0
...        ...     ...  ...   ...                      ...
1082         1       2    0  15.0                        2
1083         1       3    0  33.0                        3
1084         1       1    1  53.0                        2
1085         0       1    1  12.0                        1
1086         0       1    1  44.0                        1

      Parents/Children Aboard       Fare  FamilySize
0                           0   7.250000           1
1                           0  71.283300           1
2                           0   7.925000           0
3                           0  53.100000           1
4                           0   8.050000           0
...                       ...        ...         ...
1082                        2  54.551724           4
1083                        2  30.000000           5
1084                        0  50.000000           2
1085                        2  60.000000           3
1086                        2  80.000000           3

[1087 rows x 8 columns]

In [162]:
# Step 6: Encoding categorical data with One-Hot Encoding in scikit-learn. Here I am onehotencoding Pclass ONLY for demonstration purposes
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

column_transformer = ColumnTransformer(
    transformers=[
        ('onehot', OneHotEncoder(), ['Pclass'])
    ],
    remainder='passthrough'
)

X_encoded = column_transformer.fit_transform(titanic_df)

X_encoded_df = pd.DataFrame(X_encoded, columns=['Pclass_1', 'Pclass_2', 'Pclass_3', 'Survived', 'Sex', 'Age', 'Siblings/Spouses Aboard', 'Parents/Children Aboard', 'Fare', 'FamilySize'])
print(X_encoded_df)

      Pclass_1  Pclass_2  Pclass_3  Survived  Sex   Age  \
0          0.0       0.0       1.0       0.0  0.0  22.0
1          1.0       0.0       0.0       1.0  1.0  38.0
2          0.0       0.0       1.0       1.0  1.0  26.0
3          1.0       0.0       0.0       1.0  1.0  35.0
4          0.0       0.0       1.0       0.0  0.0  35.0
...        ...       ...       ...       ...  ...   ...
1082       0.0       1.0       0.0       1.0  0.0  15.0
1083       0.0       0.0       1.0       1.0  0.0  33.0
1084       1.0       0.0       0.0       1.0  1.0  53.0
1085       1.0       0.0       0.0       0.0  1.0  12.0
1086       1.0       0.0       0.0       0.0  1.0  44.0

      Siblings/Spouses Aboard  Parents/Children Aboard       Fare  FamilySize
0                         1.0                      0.0   7.250000         1.0
1                         1.0                      0.0  71.283300         1.0
2                         0.0                      0.0   7.925000         0.0
3                         1.0                      0.0  53.100000         1.0
4                         0.0                      0.0   8.050000         0.0
...                       ...                      ...        ...         ...
1082                      2.0                      2.0  54.551724         4.0
1083                      3.0                      2.0  30.000000         5.0
1084                      2.0                      0.0  50.000000         2.0
1085                      1.0                      2.0  60.000000         3.0
1086                      1.0                      2.0  80.000000         3.0

[1087 rows x 10 columns]

## Step 7: Splitting the dataset

In [163]:
X = titanic_df.drop('Survived', axis=1)
y = titanic_df['Survived']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=1)
print(X_train)
print()
print(X_test)

      Pclass  Sex   Age  Siblings/Spouses Aboard  Parents/Children Aboard  \
433        3    1  21.0                        2                        2
877        3    0  33.0                        0                        0
659        1    0  47.0                        0                        0
2          3    1  26.0                        0                        0
1086       1    1  44.0                        1                        2
...      ...  ...   ...                      ...                      ...
847        3    0  74.0                        0                        0
715        3    0  33.0                        0                        0
905        2    0  63.0                        3                        0
235        2    0  44.0                        1                        0
1061       1    1  54.0                        0                        1

          Fare  FamilySize
433    34.3750           4
877     7.8958           0
659    25.5875           0
2       7.9250           0
1086   80.0000           3
...        ...         ...
847     7.7750           0
715     7.7750           0
905   100.0000           3
235    26.0000           1
1061  100.0000           1

[869 rows x 7 columns]

     Pclass  Sex   Age  Siblings/Spouses Aboard  Parents/Children Aboard  \
875       1    1  56.0                        0                        1
80        3    0  29.0                        0                        0
535       3    0  69.0                        0                        0
329       1    0  45.5                        0                        0
244       1    0  44.0                        2                        0
..      ...  ...   ...                      ...                      ...
62        3    0   4.0                        3                        2
274       3    1  45.0                        0                        0
697       1    1  18.0                        1                        0
922       3    1  45.0                        3                        2
801       3    0  31.0                        0                        0

         Fare  FamilySize
875   83.1583           1
80     9.5000           0
535   14.5000           0
329   28.5000           0
244   90.0000           2
..        ...         ...
62    27.9000           5
274    7.7500           0
697  227.5250           1
922   40.0000           5
801    7.7750           0

[218 rows x 7 columns]

## Step 8: Scaling the features

In [164]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
X_train_scaled = scaler.fit_transform(X_train)
X_test_scaled = scaler.transform(X_test)
print(X_train_scaled)
print()
print(X_test_scaled)

[[ 0.89634447  1.26870391 -0.71233852 ...  1.85868186 -0.03807969
   1.81977501]
 [ 0.89634447 -0.78820597  0.09687279 ... -0.59975731 -0.58757962
  -0.71044017]
 [-1.45689826 -0.78820597  1.04095266 ... -0.59975731 -0.22043908
  -0.71044017]
 ...
 [-0.2802769  -0.78820597  2.11990108 ... -0.59975731  1.32377916
   1.18722122]
 [-0.2802769  -0.78820597  0.83864983 ... -0.59975731 -0.21187882
  -0.07788637]
 [-1.45689826  1.26870391  1.51299259 ...  0.62946227  1.32377916
  -0.07788637]]

[[-1.45689826  1.26870391  1.64786114 ...  0.62946227  0.97427793
  -0.07788637]
 [ 0.89634447 -0.78820597 -0.17286431 ... -0.59975731 -0.55428905
  -0.71044017]
 [ 0.89634447 -0.78820597  2.52450673 ... -0.59975731 -0.45052838
  -0.71044017]
 ...
 [-1.45689826  1.26870391 -0.91464135 ... -0.59975731  3.97019515
  -0.07788637]
 [ 0.89634447  1.26870391  0.90608411 ...  1.85868186  0.07865106
   2.45232881]
 [ 0.89634447 -0.78820597 -0.03799576 ... -0.59975731 -0.59008648
  -0.71044017]]